In [52]:
# Importando as bibliotecas

import pandas as pd

# Criando Series

In [53]:
# Criando o objeto data

data = [1, 2, 3, 4, 5]

In [54]:
s = pd.Series(data)

In [55]:
# Visualizando a series

s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [56]:
# Criando o index

index = ["Linha" + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [57]:
# Rotulando a series

s = pd.Series(data, index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [58]:
# Somando "2" a cada ítem da serie

s1 = s + 2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

# Data Frame

In [59]:
# cirando uma lista

data = [[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [60]:
# Criando o data frame

df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
# Criando rótulos para as linhas

index = ["Linha" + str(i) for i in range(3)]

In [62]:
# Alterando os rótulos

df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [65]:
# Criando os nomes das colunas

columns = ["Coluna" + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [75]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [77]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [68]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

# Concatenação

In [76]:
df1[df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [78]:
df2[df2 > 0] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [79]:
df3[df3 > 0] = "C"
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [80]:
# Realizando a concatenação pelas linhas

df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [81]:
# Realizando a concatenação pela colunas

df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

# Execução Exercícios

In [84]:
# Letra A

df1 = pd.DataFrame({"A": {"X" : 1}, "B": {"X": 2}})
df2 = pd.DataFrame({"C": {"X" : 1}, "D": {"X": 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  1.0  4.0

In [86]:
# letra B

dados = [["A", "B"], ["C", "D"]]
df = pd.DataFrame(dados, columns = ["L1", "L2"], index = ["C1", "C2"])
df

   L1 L2
C1  A  B
C2  C  D

In [87]:
# Letra C

dados = [[1, 2, 3], [4, 5, 6]]
index = "X, Y".split(",")
columns = list("CBA")[::-1]
df = pd.DataFrame(dados, index, columns)
df

    A  B  C
X   1  2  3
 Y  4  5  6

In [88]:
# Letra D

dados = {"A": {"X" : 1, "Y" : 3}, "B":{"X": 2, "Y": 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4